from aiogram.utils import markdown

yandex_form_link = markdown.hlink("эту форму", "https://forms.yandex.ru/u/66c0f6d42530c215f5889e54/")

lexicon = {
    'cmd_about': "<b>Политехник</b> - это неофициальный бот политехнического университета Петра Великого, созданный и поддерживаемый студентами."
                 "\n\nС помощью бота ты можешь удобно смотреть расписание своей группы, получать уведомления о внезапных изменениях в нём, искать преподавателей и многое другое"
                 f"\n\nЕсли у тебя есть предложения по функционалу бота или рекламы, заполни {yandex_form_link}."
                 "\n\nСоздатели бота: @lrrrtm и @simonoffcc",
    'cmd_menu': "<b>Главное меню</b>",
    'hello': "Привет! Это неофициальный бот политеха, с помощью которого ты можешь просматривать расписание занятий, искать преподавателей и другую информацию."
             "\n\nОтправь номер своей группы, чтобы я мог показывать тебе твоё расписание."
             f"\n\n{markdown.hblockquote('Пример номера группы: 5130904/20001. Если знаешь только часть номера, отправь её и выбери точный номер из предложенных вариантов')}"
}
